# DisjoinedSolidsInInPlaceFamily Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PerformanceFailures..::..DisjoinedSolidsInInPlaceFamily Property
BuiltInFailures..::..PerformanceFailures Class See Also
---
In-place family contains multiple disjoined solids. Consider splitting in several in-place families.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DisjoinedSolidsInInPlaceFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DisjoinedSolidsInInPlaceFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DisjoinedSolidsInInPlaceFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PerformanceFailures Class
Autodesk.Revit.DB Namespace